app/controllers/application_controller.rb

SELECT "domain_mappings".* FROM "domain_mappings" WHERE "domain_mappings"."domain" = $1 LIMIT $2  [["domain", "renshiners.freshcare.com"], ["LIMIT", 1]]
---
    def retrieve_current_account
      dm = DomainMapping.find_by_domain(request_host)