app/controllers/generated_invoices_controller.rb

SELECT "invoices".* FROM "invoices" WHERE "invoices"."clientId" = $1 AND "invoices"."timePeriod" = $2 LIMIT $3  [["clientId", "5"], ["timePeriod", "1"], ["LIMIT", 1]]
---
  def create
    invoice_params = invoice_params.merge(account_id: current_account.id)

    # Check if an invoice already exists for this client and time period
    existing_invoice = Invoice.find_by(clientId: invoice_params[:clientId], timePeriod: invoice_params[:timePeriod])