app/controllers/salaries_controller.rb

SELECT "salaries".* FROM "salaries"
---
  def index
    salaries = Salary.includes(:salary_slab_inputs).all