app/controllers/salaries_controller.rb

  def create
    existing_salary = Salary.find_by(carer_id: params[:salary][:carer_id], time_period: params[:salary][:time_period], account_id: @account_id)
---
SELECT "salaries".* FROM "salaries" WHERE "salaries"."carer_id" = $1 AND "salaries"."time_period" = $2 AND "salaries"."account_id" = $3 LIMIT $4  [["carer_id", "3"], ["time_period", "1"], ["account_id", 1], ["LIMIT", 1]]