app/models/user.rb

  def self.jwt_revoked?(payload, user)
    !user.allowlisted_jwts.exists?(payload.slice('jti', 'aud'))
---
SELECT 1 AS one FROM "allowlisted_jwts" WHERE "allowlisted_jwts"."account_id" = $1 AND "allowlisted_jwts"."user_id" = $2 AND "allowlisted_jwts"."jti" = $3 AND "allowlisted_jwts"."aud" IS NULL LIMIT $4  [["account_id", 36], ["user_id", 1], ["jti", "84692f8b-1a32-4e97-a388-a10bef86fbf5"], ["LIMIT", 1]]

  def on_jwt_dispatch(_token, payload)
    allowlisted_jwts.create!(
      jti: payload['jti'],
      aud: payload['aud'],
      exp: Time.at(payload['exp'].to_i)
    )
---
INSERT INTO "allowlisted_jwts" ("jti", "exp", "account_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"